[
    {
        "name":"Egg & mango chutney flatbreads",
        "shortName":"egg_mango_chutney_flatbreads_45116",
        "headline":"WITH A KICK OF FRESH CHILLI",
        "summary":"Fresh and quick breakfast, easily done.",
        "category":"breakfast",
        "time":12,
        "serves":2,
        "ingredients":[
            "4 large free-range eggs",
            "100 g self-raising flour , plus extra for dusting",
            "6 tablespoons natural yoghurt",
            "2 tablespoons mango chutney",
            "1 fresh red chilli"
        ],
        "instructions":[
            "Lower the eggs into a pan of vigorously simmering water and boil for 5½ minutes exactly, then refresh under cold water until cool enough to handle, and peel. Meanwhile, put a large non-stick frying pan on a medium-high heat. In a bowl, mix the flour with a little pinch of sea salt, 4 tablespoons of yoghurt and 1 tablespoon of olive oil until you have a dough. Halve, then roll out each piece on a flour-dusted surface until just under ½cm thick. Cook for 3 minutes, or until golden, turning halfway. Dot the mango chutney and remaining yoghurt over the breads. Halve the soft- boiled eggs and arrange on top, smashing them in with a fork, if you like. Finely slice the chilli and scatter over (as much as you dare!), drizzle with a little extra virgin olive oil and season with salt and black pepper from a height."
        ],
        "photoUrl":"https://cdn.jamieoliver.com/recipe-database/430_575/55846381.jpg",
        "createdBy":"sample-user"
    },
    {
        "name":"One-cup pancakes with blueberries",
        "shortName":"one_cup_pancakes_with_blueberries_99343",
        "headline":"AND A DOLLOP OF NATURAL YOGHURT",
        "summary":"These are the simplest pancakes to make with kids. You don’t even need scales to weigh out the ingredients - all you need is a cup or a mug. As long as you use the same cup for measuring both the flour and the milk, you’ll be laughing! ",
        "category":"breakfast",
        "time":12,
        "serves":4,
        "ingredients":[
            "1 large free-range egg",
            "1 cup of self-raising flour",
            "1 cup of milk",
            "200 g blueberries",
            "olive oil",
            "4 tablespoons natural yoghurt"
        ],
        "instructions":[
            "1. Crack the egg into a large mixing bowl, add the flour, milk and a tiny pinch of sea salt.",
            "2. Whisk everything together until you have a lovely smooth batter, then fold through the blueberries.",
            "3. Heat ½ a tablespoon of olive oil in a large non-stick frying pan over a medium heat, carefully tilting the pan to spread the oil out evenly.",
            "4. Add a few ladles of batter to the pan, leaving space between each one so they have room to spread out slightly – each ladleful will make one pancake, and you’ll need to work in batches.",
            "5. Cook for 1 to 2 minutes, or until little bubbles appear on the surface and the bases are golden, then carefully flip them over.",
            "6. When the pancakes are golden on both sides, remove to a plate.",
            "7. Repeat with the remaining batter, adding a little more oil to the pan between batches, if needed.",
            "8. Serve the pancakes while they’re still hot, with a dollop of yoghurt and some extra fresh berries, if you like."
        ],
        "photoUrl":"https://cdn.jamieoliver.com/recipe-database/430_575/51430777.jpg",
        "createdBy":"sample-user"
    },
    {
        "name":"Black rice pudding",
        "shortName":"black_rice_pudding_25432",
        "headline":"MANGO, LIME, PASSION FRUIT & COCONUT",
        "summary":"This healthy rice pudding recipe is super-tasty for breakfast. Hazelnut milk contains vitamin B12, helping us to think properly and stay alert, while hazelnuts are super-high in vitamin E, protecting our cells against damage. Enjoy! ",
        "category":"breakfast",
        "time":50,
        "serves":4,
        "ingredients":[
            "200 g black rice",
            "1 ripe mango",
            "1 lime",
            "1 tablespoon blanched hazelnuts",
            "1 tablespoon coconut flakes",
            "2 ripe bananas",
            "200 ml hazelnut milk",
            "1 tablespoon vanilla extract",
            "manuka honey , optional",
            "4 heaped tablespoons natural yoghurt",
            "2 wrinkly passion fruit"
        ],
        "instructions":[
            "1. Cook the black rice according to the packet instructions, overcooking it slightly so it’s plump and sticky, then drain and cool.",
            "2. Meanwhile, peel and destone the mango, blitz the flesh in a blender with the lime juice until smooth, and pour into a bowl.",
            "3. Separately, toast the hazelnuts and coconut in a dry frying pan until lightly golden, then bash up in a pestle and mortar.",
            "4. Peel the bananas and tear into the blender, then blitz with the hazelnut milk, vanilla extract and two-thirds of the black rice – depending on the sweetness of your bananas, you could also add a teaspoon of honey.",
            "5. Once smooth, stir that back through the rest of the rice – this will give you great texture and colour. Divide between four nice jars or bowls.",
            "6. Spoon over the blitzed mango, squeeze half a passion fruit over each one, then delicately spoon over the yoghurt and sprinkle with the hazelnuts and coconut."
        ],
        "photoUrl":"https://cdn.jamieoliver.com/recipe-database/430_575/53243811.jpg",
        "createdBy":"admin"
    },
    {
        "name":"Simple cheese omelette",
        "shortName":"simple_cheese_omelette_38869",
        "headline":"SIMPLE, QUICK AND NUTRITIOUS",
        "summary":"This is a great quick meal at any time of the day. Eggs are a fantastic, affordable source of protein, helping our muscles to grow and repair and helping us to feel fuller for longer. Serve your omelette with wholemeal bread and a simple tomato salad for a healthy, balanced meal. ",
        "category":"breakfast",
        "time":10,
        "serves":1,
        "ingredients":[
            "2 large free-range eggs",
            "olive oil",
            "10 g Cheddar cheese"
        ],
        "instructions":[
            "1. Crack the eggs into a mixing bowl, season with a pinch of sea salt and black pepper, then beat well with a fork until fully combined.",
            "2. Place a small non-stick frying pan on a low heat to warm up.",
            "3. Grate the cheese onto a board and set aside.",
            "4. Add ½ tablespoon of oil to the hot pan, then carefully pour in the eggs.",
            "5. Tilt the pan to spread them out evenly, using a fork to swirl the eggs around the pan a little.",
            "6. When the omelette begins to cook and firm up, but still has a little raw egg on top, sprinkle over the cheese.",
            "7. Using a spatula, ease around the edges of the omelette, then fold it over in half.",
            "8. When it starts to turn golden brown underneath, remove the pan from the heat and slide the omelette onto a plate.",
            "9. Delicious with a tomato salad and wholemeal bread."
        ],
        "photoUrl":"https://cdn.jamieoliver.com/recipe-database/430_575/0siQaM1MqTv8KwCQYOv41F.jpg",
        "createdBy":"admin"
    },
    {
        "name":"Omelette aux fines herbes",
        "shortName":"omelette_aux_fines_herbes_57318",
        "headline":"TASTY AND DIFFERENT",
        "summary":"The original, and best, simple Sunday supper for one.",
        "category":"breakfast",
        "time":10,
        "serves":1,
        "ingredients":[
            "2 large free-range eggs",
            "a few sprigs of mixed herbs, such as chives",
            "tarragon, chervil and parsley",
            "1 large knob of butter"
        ],
        "instructions":[
            "1. Break the eggs into a bowl and whisk lightly with a fork. Chop and add the herbs and season with sea salt and black pepper.",
            "2. Heat the butter in a 23cm non-stick or cast-iron pan over a medium-high heat until foaming.",
            "3. Once the foam dies down, pour in the egg mixture and gently shake the pan to distribute. Cook for 20 seconds or so, until it begins to bubble, then draw it into the centre with a wooden spoon and shake the pan again to redistribute the uncooked egg.",
            "4. Cook the omelette until the base is set, but it is still slightly runny in the middle (unless you don’t like that).",
            "5. Remove the pan from the heat and fold 2 sides into the middle. Shake the pan so the edges roll together then turn the omelette onto a plate, folding it over in the process. Serve with crusty bread."
        ],
        "photoUrl":"https://cdn.jamieoliver.com/recipe-database/430_575/CtvjX5FWK6v8CK0HTX8OaM.jpg",
        "createdBy":"admin"
    },
    {
        "name":"Mushroom and chestnut pithivier",
        "shortName":"mushroom_and_chestnut_pithivier_48594",
        "headline":"Tasty French Pie",
        "summary":"This French pie makes a wonderful Christmas table centrepiece.",
        "category":"dinner",
        "time":100,
        "serves":8,
        "ingredients":[
            "1 tbsp olive oil",
            "2 shallots, finely chopped",
            "15g butter",
            "150g pack Portabello Mushrooms, chopped",
            "250g chestnut mushrooms, sliced",
            "1 tbsp chopped fresh thyme",
            "1 tbsp chopped fresh parsley",
            "4 tbsp Asda Pale Sherry",
            "200g pack Merchant Gourmet Vacuum Packed Chestnuts, roughly chopped",
            "1 level tsp cornflour",
            "75g crème fraîche",
            "500g pack puff pastry",
            "Flour for rolling out",
            "1 medium egg, beaten",
            "Vegetables, to serve"
        ],
        "instructions":[
            "1. Pre-heat the oven to 220C/200C Fan/Gas 7. Heat the oil in a pan and cook the chopped shallots over a medium heat until soft and translucent, stirring occasionally.",
            "2. Add the butter and both types of mushrooms and continue to cook, stirring occasionally, until all the juices run out. Add the thyme, parsley, sherry and chestnuts and continue to cook for about 10 minutes, stirring often, until most of the juices have evaporated.",
            "3. Mix the cornflour with 2 tsp water until smooth, then stir into the mushrooms with the crème fraîche and heat until boiling. Simmer for 2 minutes. Season well, then tip into a cold bowl and leave to cool.",
            "4. Divide the pastry into two pieces and roll each out onto a lightly floured surface. Make one 25cm round and one 27cm round. Put on two baking trays, lined with cling film. Cover with more cling film and chill while the filling cools. Remove all the cling film and put the smaller piece of pastry back on a baking tray. Pile on the filling, leaving a 2cm border round the edge. Brush the border with beaten egg.",
            "5. Put the other piece of pastry on top and press the edges together. Brush with more egg. Mark the top with a knife to make curved lines going out from the centre, taking care not to cut through the pastry.",
            "6.Bake for 25-35 minutes until crisp and golden."
        ],
        "photoUrl":"https://i.pinimg.com/736x/81/b7/66/81b766737dbf54e509520ac3c9e405d6--pithiviers-recipes-dinner.jpg",
        "createdBy":"admin"
    },
    {
        "name":"Roast chicken and crispy bread salad",
        "shortName":"roast_chicken_and_crispy_bread_salad_38306",
        "headline":"WITH FRESH THYME, SWEET RAISINS & NUTS",
        "summary":"Chicken thighs are fantastic - they're cheaper than other cuts, and full of flavour. The key to cooking them perfectly is to start them off at a higher temperature, then reduce the heat for the last 10 minutes or so. Not only will this ensure the chicken stays nice and moist, but it will give it a lovely crispy skin, too.",
        "category":"salad",
        "time":45,
        "serves":4,
        "ingredients":[
            "6 free-range chicken thighs , skin on",
            "bone out",
            "olive oil",
            "lemon",
            "4 cloves of garlic",
            "a few sprigs of fresh thyme",
            "150 g ciabatta",
            "50 g pine nuts",
            "extra virgin olive oil"
        ],
        "instructions":[
            "1. Preheat the oven to 200ºC/400ºF/gas 6.",
            "2. Put the chicken in a baking dish and rub with a little olive oil. Quarter the lemon and arrange in the dish with the unpeeled garlic. Tuck the thyme around the chicken, season well with sea salt and black pepper and roast for 30 minutes.",
            "3. Remove from the oven, then pick out and reserve the lemon and garlic. Tear the ciabatta into bite-sized pieces and add, tossing to coat in the juices, then scatter over the pine nuts.",
            "4. Return the dish to the oven, reduce the temperature to 180ºC/350ºF/gas 4 and cook for 10 minutes, stirring halfway through.",
            "5. Meanwhile, in a small bowl mix 2 tablespoons of extra virgin olive oil with the honey, then squeeze in the soft, sweet garlic (discarding the skins) and the juice from the roasted lemon, mashing as you go, until combined. Season to taste.",
            "6. Remove the dish from the oven, strip over the roasted thyme leaves, stir in the raisins and pour over the dressing. Cut the chicken into thick slices, then fold through the rocket, and serve straight from the dish or plate up."
        ],
        "photoUrl":"https://cdn.jamieoliver.com/recipe-database/xtra_med/58393577.jpg",
        "createdBy":"admin"
    },
    {
        "name":"Print Hearts of palm and chicken salad",
        "shortName":"print_hearts_of_palm_and_chicken_salad_23306",
        "headline":"WITH ZINGY LIME, MANGO, AVO & FETA",
        "summary":"This lovely summer salad layers up honey-glazed chicken breast with beautiful textures, such as crunchy toasted seeds, juicy mango and crisp hearts of palm.",
        "category":"salad",
        "time":35,
        "serves":4,
        "ingredients":[
            "2 free-range skinless chicken breasts",
            "1 teaspoon sweet smoked paprika",
            "½ teaspoon ground cumin",
            "5 sprigs of fresh thyme",
            "30 g pumpkin seeds",
            "olive oil",
            "1 teaspoon runny honey",
            "1 ripe mango",
            "1 x 400 g tin of hearts of palm",
            "2 ripe avocados",
            "2 little gem lettuces",
            "75 g wild rocket",
            "2 limes",
            "extra virgin olive oil",
            "40 g feta cheese",
            "1 punnet of coriander cress"
        ],
        "instructions":[
            "1. Place the chicken breasts on a large sheet of greaseproof paper, a few centimetres apart, and sprinkle with the paprika and cumin. Pick over the thyme leaves and cover with another sheet of greaseproof paper.",
            "2. Using a heavy pan or a rolling pin, bash the chicken breasts to flatten them out to an even thickness all over.",
            "3. Place a large non-stick frying pan over a medium-low heat and scatter in the pumpkin seeds. Toast for a few minutes until they’re golden and start to ‘pop’. Remove from the pan and set aside.",
            "4. Return the pan to the hob, drizzle in 1 tablespoon of olive oil and, once hot, pop in the chicken, seasoned-side down. Fry for 3 to 5 minutes, or until golden. Flip over and cook for a further 2 minutes, or until golden and cooked through.",
            "5. Drizzle with 1 teaspoon of honey, cook for further 1 minute, then remove from the pan and place on a chopping board until cool enough to handle.",
            "6. Meanwhile, peel and roughly chop the mango. Drain the hearts of palm and chop up with the mango and cooled chicken.",
            "7. Halve the avocados and scoop out the flesh onto the board, then top with the lettuce and rocket. Run your knife through everything a couple of times until it is all chopped and mixed together.",
            "8. Squeeze over the lime juice, season well with sea salt and black pepper, then drizzle with extra virgin olive oil. Toss it all together, then scoop the salad into a serving bowl or platter.",
            "9. Crumble over the feta, sprinkle with the toasted pumpkin seeds and snip over the cress."
        ],
        "photoUrl":"https://cdn.jamieoliver.com/recipe-database/xtra_med/49988694.jpg",
        "createdBy":"admin"
    }

]
